---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeRightSupportLateralOffset
source: html/473cb93b-f7b7-191c-8a64-e5eb6ce28d44.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeRightSupportLateralOffset Property

"Right Lateral Offset":

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeRightSupportLateralOffset { get; }
```